# 1.	Access Specific Columns:
### a.	How can you retrieve and display only the name and age columns from the DataFrame? Write the code to accomplish this.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("data_studentlist.csv")
data

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [3]:
data[['name', 'age']]

                name  age
0      Jared Diamond   23
1     Sarah O'Donnel   22
2       Brian Martin   24
3       David Hassel   23
4    Clara Rodriquez   20
5   Jennifer Lorentz   21
6        Susan Clark   22
7    Margareth Jones   23
8       John Bertsch   23
9     Jake Timmerman   22
10     Joshua Connor   24
11      John Matsuda   22
12      Eddy Johnson   21
13  Rebecah Anderson   23
14      Linda Carter   22
15    Richard Swayze   24
16       Andrew King   21

# 2.	Access Specific Rows:
### a.	What method would you use to access the first three rows of the DataFrame? Write the code to access and print the last two rows.

In [4]:
data.head(3)

             name gender  age  grade absence bloodtype  height  weight
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

# 3.	Access a Specific Cell:
### a.	How can you access the grade of the student located in the second row (index 1) of the DataFrame? Provide the code for this operation.

In [5]:
grade = data[1: 2]
grade.gender

1    F
Name: gender, dtype: object

# 4.	Using loc to Filter Data:
### a.	Write a command using the loc method to filter and display the names and grades of students who are older than 15 years.

In [6]:
name = data.loc[:,['name', 'gender']]
newname = name.loc[ (data['age'] > 20)]

newname

                name gender
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

# 5.	Count Unique Values:
### a.	How can you determine the number of unique blood types present in the dataset? Provide the code to count and print the unique blood types.

In [7]:
data['bloodtype'].unique()

array(['O', 'AB', 'B', 'A'], dtype=object)

In [8]:
count = 0
for i in data['bloodtype'].unique():
    count += 1

count

4

# 6.	Calculate Average Height:
### a.	What is the method to calculate the average height of students in the DataFrame? Write the code to compute and display this average.

In [9]:
sumOfHeight = data['height'].values.sum()

average = sumOfHeight / len(data['height'])

In [10]:
average.round()

170.0


# 7.	Group By and Aggregate:
### a.	How can you group the data by gender and calculate the average age for each gender? Write the code to perform this aggregation and print the results.

In [11]:
average_of_genders = data.groupby('gender').agg('age').mean()

In [12]:
average_of_genders

gender
F    21.857143
M    22.700000
Name: age, dtype: float64

# 8.	Create a New Column:
### a.	Explain how you would create a new column named BMI in the DataFrame, calculated as weight (kg) divided by the square of height (m). Provide the code for adding this new column and display the updated DataFrame.
### i.	BMI calculated as weight (kg) / (height (m)^2). Print the updated DataFrame.

In [13]:
data['BMI'] = data['weight'] / (data['height'] ** 2)

In [14]:
data

,name,gender,age,grade,absence,bloodtype,height,weight,BMI
0,Jared Diamond,M,23,3,Y,O,165.3,68.2,0.002496
1,Sarah O'Donnel,F,22,2,N,AB,170.1,53.0,0.001832
2,Brian Martin,M,24,4,N,B,175.0,80.1,0.002616
3,David Hassel,M,23,3,N,AB,182.1,85.7,0.002584
4,Clara Rodriquez,F,20,1,Y,A,168.0,49.5,0.001754
5,Jennifer Lorentz,F,21,2,N,O,162.0,52.0,0.001981
6,Susan Clark,F,22,1,N,O,155.2,45.3,0.001881
7,Margareth Jones,F,23,1,N,A,176.9,55.0,0.001758
8,John Bertsch,M,23,3,N,B,178.5,64.2,0.002015
9,Jake Timmerman,M,22,2,N,B,176.1,61.3,0.001977
10,Joshua Connor,M,24,4,Y,O,167.1,62.0,0.002220
11,John Matsuda,M,22,2,N,AB,180.0,75.8,0.002340
12,Eddy Johnson,M,21,1,N,A,162.2,55.3,0.002102
13,Rebecah Anderson,F,23,3,N,O,176.1,53.1,0.001712
14,Linda Carter,F,22,2,N,B,158.2,45.2,0.001806
15,Richard Swayze,M,24,4,Y,B,168.6,70.2,0.002470
16,Andrew King,M,21,1,N,A,169.2,62.2,0.002173

In [15]:

data.loc[:, (data.columns != 'nme') & (data.columns!='gender') ]

                name  age  grade absence bloodtype  height  weight       BMI
0      Jared Diamond   23      3       Y         O   165.3    68.2  0.002496
1     Sarah O'Donnel   22      2       N        AB   170.1    53.0  0.001832
2       Brian Martin   24      4       N         B   175.0    80.1  0.002616
3       David Hassel   23      3       N        AB   182.1    85.7  0.002584
4    Clara Rodriquez   20      1       Y         A   168.0    49.5  0.001754
5   Jennifer Lorentz   21      2       N         O   162.0    52.0  0.001981
6        Susan Clark   22      1       N         O   155.2    45.3  0.001881
7    Margareth Jones   23      1       N         A   176.9    55.0  0.001758
8       John Bertsch   23      3       N         B   178.5    64.2  0.002015
9     Jake Timmerman   22      2       N         B   176.1    61.3  0.001977
10     Joshua Connor   24      4       Y         O   167.1    62.0  0.002220
11      John Matsuda   22      2       N        AB   180.0    75.8  0.002340
12      Eddy Johnson   21      1       N         A   162.2    55.3  0.002102
13  Rebecah Anderson   23      3       N         O   176.1    53.1  0.001712
14      Linda Carter   22      2       N         B   158.2    45.2  0.001806
15    Richard Swayze   24      4       Y         B   168.6    70.2  0.002470
16       Andrew King   21      1       N         A   169.2    62.2  0.002173

In [16]:
data[data.gender == 'M']

,name,gender,age,grade,absence,bloodtype,height,weight,BMI
0,Jared Diamond,M,23,3,Y,O,165.3,68.2,0.002496
2,Brian Martin,M,24,4,N,B,175.0,80.1,0.002616
3,David Hassel,M,23,3,N,AB,182.1,85.7,0.002584
8,John Bertsch,M,23,3,N,B,178.5,64.2,0.002015
9,Jake Timmerman,M,22,2,N,B,176.1,61.3,0.001977
10,Joshua Connor,M,24,4,Y,O,167.1,62.0,0.002220
11,John Matsuda,M,22,2,N,AB,180.0,75.8,0.002340
12,Eddy Johnson,M,21,1,N,A,162.2,55.3,0.002102
15,Richard Swayze,M,24,4,Y,B,168.6,70.2,0.002470
16,Andrew King,M,21,1,N,A,169.2,62.2,0.002173

In [17]:
data[(data.gender == 'M') & (data.grade > 1)]

,name,gender,age,grade,absence,bloodtype,height,weight,BMI
0,Jared Diamond,M,23,3,Y,O,165.3,68.2,0.002496
2,Brian Martin,M,24,4,N,B,175.0,80.1,0.002616
3,David Hassel,M,23,3,N,AB,182.1,85.7,0.002584
8,John Bertsch,M,23,3,N,B,178.5,64.2,0.002015
9,Jake Timmerman,M,22,2,N,B,176.1,61.3,0.001977
10,Joshua Connor,M,24,4,Y,O,167.1,62.0,0.002220
11,John Matsuda,M,22,2,N,AB,180.0,75.8,0.002340
15,Richard Swayze,M,24,4,Y,B,168.6,70.2,0.002470

In [18]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        }

In [19]:
data = pd.DataFrame(data)

In [20]:
# Select the 'music', 'science' score data. Save to variable music_sci
music_sci = data[['state', 'year']]
print(music_sci)

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [21]:
data.loc[0] = 0

In [22]:
data

    state  year  pop
0       0     0  0.0
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
print(data)

    state  year  pop
0       0     0  0.0
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [24]:
exam_data = {'name' : [ 'stu1', 'stu2', 'stu3'],
             'math' : [ 90, 80, 70],
             'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100],
             'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
# Designating the column "name" as a new index and reflect changes to the df object.
df.set_index('name', inplace=True)
print(df)

      math  eng  music  science
name
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [25]:
c = df.loc['stu1', ['music', 'science']]
print(c)
d = df.iloc[0, [2, 3]]
print(d)
e = df.loc['stu1', 'music':'science']
print(e)
f = df.iloc[0, 2:]
print(f)

music       85
science    100
Name: stu1, dtype: int64
music       85
science    100
Name: stu1, dtype: int64
music       85
science    100
Name: stu1, dtype: int64
music       85
science    100
Name: stu1, dtype: int64

In [26]:
myData = {
    'Score': [85, 90, 78, 92],
    'Grades': ['A', 'B', 'C', 'B'],
    'sd': [85, 90, 78, 92],
    'sde3*': ['A', 'B', 'C', 'B']
}
df = pd.DataFrame(myData, index=['AP', 'DSTT', 'RM', 'DSSM'])

In [27]:
df

      Score Grades  sd sde3*
AP       85      A  85     A
DSTT     90      B  90     B
RM       78      C  78     C
DSSM     92      B  92     B

In [48]:
data['state']

0         0
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object